export const SchoolYears = [
    ["2028", "2028-2029"],
    ["2027", "2027-2028"],
    ["2026", "2026-2027"],
    ["2025", "2025-2026"],
    ["2024", "2024-2025"],
    ["2023", "2023-2024"],
    ["2022", "2022-2023"],
    ["2021", "2021-2022"],
    ["2020", "2020-2021"],
    ["2019", "2019-2020"],
    ["2018", "2018-2019"],
    ["2017", "2017-2018"],
    ["2016", "2016-2017"],
    ["2015", "2015-2016"],
    ["2014", "2014-2015"],
    ["2013", "2013-2014"],
    ["2012", "2012-2013"],
    ["2011", "2011-2012"],
    ["2010", "2010-2011"],
    ["2009", "2009-2010"],
    ["2008", "2008-2009"],
    ["2007", "2007-2008"],
    ["2006", "2006-2007"],
    ["2005", "2005-2006"],
];

export const SchoolTerms = [
    ["3", "1"],
    ["12", "2"],
    ["16", "3"],
]

export const Schools = [
    ["10100", "党委办公室、校长办公室（校务督查办公室、法治与法务办公室）"],
    ["10300", "党委组织部（中共广西大学委员会党校）"],
    ["10400", "党委宣传部"],
    ["10500", "党委学生工作部、学生工作处、武装部（就业指导中心）"],
    ["10700", "校团委"],
    ["10800", "校工会"],
    ["20100", "党委教师工作部、人力资源处"],
    ["20200", "发展规划处"],
    ["20300", "教务处（教师教学发展中心）"],
    ["20400", "研究生院"],
    ["20700", "国有资产与实验室管理处（招标与采购管理中心）"],
    ["20800", "财务处"],
    ["20900", "招生就业指导中心"],
    ["21000", "离退休工作处"],
    ["21200", "保卫处（治安综合治理委员会办公室）"],
    ["21300", "校友工作办公室"],
    ["21500", "国际合作与交流处（港澳台事务办公室、留学生管理服务中心）"],
    ["21600", "科研院"],
    ["04070F72F38A65E1E063020410AC9F71", "教育教学质量监控与评价中心（高等教育研究所、教学督导团）"],
    ["25000", "后勤管理处"],
    ["25100", "后勤基建处"],
    ["30100", "机械工程学院"],
    ["30200", "电气工程学院"],
    ["30300", "土木建筑工程学院"],
    ["30400", "化学化工学院"],
    ["30500", "轻工与食品工程学院"],
    ["30700", "计算机与电子信息学院"],
    ["31000", "海洋学院"],
    ["31100", "数学与信息科学学院"],
    ["31200", "物理科学与工程技术学院"],
    ["31300", "生命科学与技术学院"],
    ["31600", "马克思主义学院"],
    ["31700", "艺术学院"],
    ["32000", "新闻与传播学院"],
    ["32100", "文学院"],
    ["32200", "公共管理学院"],
    ["32300", "商学院"],
    ["32400", "法学院"],
    ["32500", "外国语学院"],
    ["33100", "农学院"],
    ["33400", "动物科学技术学院"],
    ["33600", "林学院"],
    ["33700", "医学院"],
    ["33900", "资源环境与材料学院"],
    ["34000", "中国－东盟经济学院／经济学院／中国－东盟金融合作学院"],
    ["34100", "体育学院"],
    ["34200", "工商管理学院"],
    ["34300", "经济学院／中国—东盟金融合作学院"],
    ["713531B3C2D93E41E053020410AC9D64", "国际学院"],
    ["40100", "图书馆"],
    ["40200", "信息网络中心（网络安全与信息化办公室）"],
    ["40400", "图书馆（档案馆）"],
    ["41600", "中国－东盟研究院／广西创新发展研究院"],
    ["60100", "资产经营有限公司"],
    ["60200", "农牧产业发展研究院"],
]

export interface QueryModel {
    currentPage: number;
    currentResult: number;
    entityOrField: boolean;
    limit: number;
    offset: number;
    pageNo: number;
    pageSize: number;
    showCount: number;
    sorts: any[];
    totalCount: number;
    totalPage: number;
    totalResult: number;
}

export interface UserModel {
    monitor: boolean;
    roleCount: number;
    roleKeys: string;
    roleValues: string;
    status: number;
    usable: boolean;
}

// 教务系统查询类请求接口返回的基本数据类型，看上去是数据库分页查询时的通用参数
export interface QueryResRoot {
    // 当前页
    currentPage: number;
    // 当前结果？
    currentResult: number;
    // 是否是实体还是字段？
    entityOrField: boolean;
    // 每页显示数量
    limit: number;
    // 分页偏移量
    offset: number;
    // 页码？
    pageNo: number;
    // 每页显示数量
    pageSize: number;
    // 显示数据总数（？）可能用于遍历
    showCount: number;
    // 排序字段？
    sortName: string;
    // 排序方式，asc/desc
    sortOrder: string;
    // 排序字段列表？
    sorts: any[];
    // 符合查询条件的总数，包括没有返回的数据，用于前端分页组件计算总页数等等
    totalCount: number;
    // 符合查询条件的总页数，用于前端分页组件显示
    totalPage: number;
    // 符合查询条件的总结果数，用于前端分页组件显示？
    totalResult: number;
}
